// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. Не использовать string[]

//645 -> 5  
//78 -> третьей цифры нет
//32679 -> 6

Console.WriteLine("Задайте любое число");
int number = int.Parse(Console.ReadLine());
Console.WriteLine(number);